from openpyxl import load_workbook
import psycopg2
conn = psycopg2.connect(dbname='d6vjl3au6tld96', user='exmeqvroilujbg',
                        password='2dbe50b6c122dfabebc0f19ad65d8d6e180f13927943103314036738f4ffad22',
                        host='ec2-54-228-181-43.eu-west-1.compute.amazonaws.com')

cursor = conn.cursor()
cursor.execute('SELECT * FROM library;')

wb_example = load_workbook('./table.xlsx')
ws_example = wb_example.active

wb_input = load_workbook('./библиотека.xlsx')
ws_input = wb_input.active
# EGE - 3
# Essay - 4
# OGE - 5
OGEDirections = [
    "Преданность",
    "Человечность",
    "Любовь",
    "Настоящее искусство",
    "Сострадание",
    "Доброта",
    "Самовоспитание",
    "Подвиг",
    "Совесть"
]

EGEDirecions = [
    "Человек и природа",
    "Проблемы семьи",
    "Проблемы, связанные с отрицательными качествами личности",
    "Проблемы, связанные с положительными нравственными качествами личности",
    "Проблемы, связанные с ролью искусства и литературы в жизни человека",
    "Человек и общество",
    "Военная проблематика",
    "Социальной ответственности ученых за их изобретения",
    "Проблема одиночества",
    "Человек и государственная власть (политическая)"
]

EssayDirections = [
    "«Верность и измена»",
    "«Равнодушие и отзывчивость»",
    "«Цели и средства»",
    "«Смелость и трусость»",
    "«Человек и общество»"
]
Section = [
    "Биографии российских знаменитостей",
    "Военная литература",
    "Домоводство",
    "Дополнительное учебное пособие",
    "Зарубежная литература",
    "Историческая проза",
    "Исторические романы",
    "История и теория литературы",
    "История. Археология. Этнография",
    "Классическая и современная проза",
    "Литература для детей",
    "Литература для школьников",
    "Литературная критика",
    "Повести и рассказы о животных",
    "Познавательная литература",
    "Поэзия",
    "Приключенческие романы",
    "Публицистика",
    "Путешествия. Хобби. Фото. Спорт",
    "Рассказы",
    "Транспорт",
    "Фантастика. Фэнтези. Мистика"
]
Directions = [EGEDirecions, EssayDirections, OGEDirections]
rowNumber = 1

for row in cursor.fetchall():
    print(row[1:])

wb_example.save('./table.xlsx')
cursor.close()
conn.close()
